#+title: Ps 07
#+author: Erik An
#+email: obluda2173@gmail.com
#+date: <2026-05-03>
#+lastmod: <2026-05-04 15:48>
#+latex: \newpage
#+latex_header: \setlength{\parindent}{0pt}
#+latex_header: \setlength{\parskip}{1em}
#+latex_header: \usepackage{amsmath}
#+latex_header: \usepackage{amssymb}
#+latex_header: \usepackage{mathtools}
#+latex_header: \usepackage{amsthm}
#+latex_header: \usepackage[margin=1in]{geometry}
#+options: num:t tags:nil
#+property: header-args :eval never-export
#+startup: overview latexpreview inlineimages

**** (a)

#+begin_src julia :results value
using DataFrames

R_e1(a) = [1 0          0
           0 cospi(a)  -sinpi(a)
           0 sinpi(a)   cospi(a)]

R_e2(a) = [ cospi(a) 0 sinpi(a)
            0        1 0
           -sinpi(a) 0 cospi(a)]

R_e3(a) = [cospi(a) -sinpi(a) 0
           sinpi(a)  cospi(a) 0
           0         0        1]

M = [1 2 3
     4 5 6
     7 8 9]

DataFrame(R_e1(1//2) * M, :auto)
#+end_src

#+RESULTS:
|  1.0 |  2.0 |  3.0 |
| -7.0 | -8.0 | -9.0 |
|  4.0 |  5.0 |  6.0 |

Each $R_{e_i, \theta}$ fixes $e_i$ and rotates the orthogonal plane $\mathrm{span}(e_j, e_k)$ by $\theta$, where $(j,k)$ is chosen so that $e_j \times e_k = e_i$.

- $R_{e_1, \alpha}$: fixes $e_1$, rotates $(e_2, e_3)$ by $\alpha$.

- $R_{e_2, \beta}$: fixes $e_2$, rotates $(e_3, e_1)$ by $\beta$. The transposed sign pattern in the $(1,3)$ block reflects that the canonical order $(e_1, e_3)$ is left-handed relative to $e_2$.

- $R_{e_3, \gamma}$: fixes $e_3$, rotates $(e_1, e_2)$ by $\gamma$.

**** (b)

#+begin_src julia :results value
using DataFrames

R_e1(a) = [1 0          0
           0 cospi(a)  -sinpi(a)
           0 sinpi(a)   cospi(a)]

R_e2(a) = [ cospi(a) 0 sinpi(a)
            0        1 0
           -sinpi(a) 0 cospi(a)]

R_e3(a) = [cospi(a) -sinpi(a) 0
           sinpi(a)  cospi(a) 0
           0         0        1]

R(a) = R_e3(a) * R_e2(a) * R_e1(a)

M = [1 2 3
     4 5 6
     7 8 9]

DataFrame(R(1//2) * M, :auto)
#+end_src

#+RESULTS:
|  7.0 |  8.0 |  9.0 |
|  4.0 |  5.0 |  6.0 |
| -1.0 | -2.0 | -3.0 |

